------------------------------------1. По каждому направлению обучения вывести количество групп и количество студентов----------------------------------------
--USE PV_521_Import;
--SELECT
--				direction_name					AS		N'Направление обучения'
--			,	COUNT(stud_id)					AS		N'Количество студентов'
--			,	COUNT(DISTINCT group_id)		AS		N'Количество групп'
----https://learn.microsoft.com/ru-ru/sql/t-sql/functions/count-transact-sql?view=sql-server-ver17
--FROM			Students, Groups, Directions
--WHERE			[group]					=		group_id			
--AND			direction				=		direction_id
--GROUP BY		direction_name
--;

------------------------------------2. Для каждого преподавателя вывести количество дисциплин, котороые он может вести----------------------------------------
--USE PV_521_Import;
--SELECT
--				[Преподаватель]										=		FORMATMESSAGE(N'%s %s %s', last_name, first_name, middle_name)						
--			,	COUNT(TeachersDisciplinesRelation.discipline)		AS		N'Количество дисциплин'
--FROM			Teachers, TeachersDisciplinesRelation
--WHERE			Teachers.teacher_id									=		TeachersDisciplinesRelation.teacher
--Group BY teacher_id, last_name, first_name, middle_name
--;

------------------------------3. Для каждой дисциплины вывести количество преподавателей, которые могут вести эту дисциплину----------------------------------
--USE PV_521_Import;
--SELECT
--				discipline_name								AS		N'Дисциплина'
--			,	COUNT(teacher)								AS		N'Количество преподавателей'
--FROM			Disciplines, TeachersDisciplinesRelation
--WHERE			Disciplines.discipline_id					=		discipline
--GROUP BY		discipline_name
--;

-------------------------------------4. Заполнить таблицу с расписанием для своей группы от начала обучения по сей день---------------------------------------
--Заполнение дисциплин
USE PV_521;

--INSERT Disciplines
--		 (discipline_id, discipline_name, numbers_of_lessons)
--VALUES 
--		 (1, N'Основы информационных технологий', 50)
--		,(2, N'Основы программирования на языке с++', 138)
--		,(3, N'Конфигурирование Windows 10', 66)
--		,(4, N'Объектно-ориентированное программирование с использованием языка с++', 114)
--		,(5, N'Объектно-ориентированное проектирование. Язык UML и паттерны проектирования', 38)
--		,(6, N'Платформа Microsoft.NET и язык программирования с#', 70)
--		,(7, N'Основы разработки приложений с использованием Windows Forms и WPF', 66)
--		,(8, N'Теория баз данных. Программирование MS SQL Server', 44)
--;

--SELECT 
--         discipline_name        AS      N'Название дисциплины'
--        ,numbers_of_lessons      AS     N'Количество часов'
--FROM Disciplines;	

--DELETE FROM Disciplines WHERE discipline_id IN (1, 2, 3, 4, 5, 6, 7, 8);	

--===================================================================================================================================================--
--Заполнение преподавателей

--Insert	Teachers
--			(last_name, first_name, middle_name, birth_date)
--VALUES
--			(N'Ковтун ', N'Олег ', N'Анатольевич ', N'1970-02-15')
--		   ,(N'Свищев ', N'Алексей ', N'Викторович ', N'1970-02-15')
--;

--SELECT 
--		last_name AS N'Фамилия'
--       ,first_name AS N'Имя'
--       ,middle_name AS N'Отчество'
--       ,birth_date AS N'Дата рождения'
--FROM Teachers;
--===================================================================================================================================================--
--Заполнение Направлений
--INSERT Directions
--		 (direction_id, direction_name)
--VALUES 
--		 (1, N'Разработка программного обеспечения')
--		,(2, N'Сетевые технологии и системное администрирование')
--		,(3, N'Компьютерная графика и дизайн')
--		,(4, N'')
--;

--DELETE FROM Directions WHERE direction_id IN (1, 2, 3);

--===================================================================================================================================================--
--Заполнение Групп
--INSERT			Groups
--				(group_id, group_name, direction)
--VALUES
--		(1, N'PV_521', )
--;
--SELECT 
--		  group_name AS N'Группа'
--       ,direction AS N'Направление'
--FROM Groups;

--===================================================================================================================================================--
--Заполнение Студентов
--INSERT		Students
--			(last_name, first_name, middle_name, birth_date, [group])
--VALUES
--			 (N'Полищук', N'Андрей', N'Григорьевич', N'1970-02-15', 1)
--			,(N'Жук', N'Василий', N'Анатольевич', N'1970-02-15', 1)
--			,(N'Голумбиевская', N'Екатерина', N'Александровна', N'1970-02-15', 1)
--			,(N'Юзгин', N'Николай', N'Игоревич', N'1970-02-15', 1)
--			,(N'Тарасов', N'Евгений', N'Алексеевич', N'1970-02-15', 1)
--			,(N'ZXC', N'Tulskiy', N'Ghoul', N'1970-02-15', 1)
--			,(N'Хромов', N'Сергей', N'Александрович', N'1970-02-15', 1)
--			,(N'Вербицкий', N'Илья', N'Юрьевич', N'1970-02-15', 1)
--			,(N'Султанов', N'Ростислав', N'Витальевич', N'1970-02-15', 1)
--			,(N'Пеливанов', N'Иван', N'Иванович', N'1970-02-15', 1)
--			,(N'Черепенин', N'Матвей', N'Алексеевич', N'1970-02-15', 1)
--			,(N'Литвинов', N'Ярослав', N'Александрович', N'1970-02-15', 1)
--			,(N'Кнюдде', N'Сергей', N'Евгеньевич', N'1970-02-15', 1)
--			,(N'Цыбулько', N'Богдан', N'Романович', N'1970-02-15', 1)
--			,(N'Вилль', N'Никита', N'Андреевич', N'1970-02-15', 1)
--			,(N'Колесников', N'Эдуард', N'Геннадиевич', N'1970-02-15', 1)
--			,(N'Репин', N'Рамиль', N'Сеймурович', N'1970-02-15', 1)
--			,(N'Серова', N'Дарья', N'Романовна', N'1970-02-15', 1)
--			,(N'Аркатов', N'Тимур', N'Александрович', N'1970-02-15', 1)
--			,(N'Калинин', N'Виталий', N'Алексеевич', N'1970-02-15', 1)
--			,(N'Соколов', N'Александр', N'Валерьевич', N'1970-02-15', 1)
--			,(N'Перин', N'Илья', N'Вадимович', N'1970-02-15', 1)
--			,(N'Иванов', N'Максим', N'Олегович', N'1970-02-15', 1)
--			,(N'Юшков', N'Лаврентий', N'Тихонович', N'1970-02-15', 1)
--			,(N'Морозов', N'Дмитрий', N'Евгеньевич', N'1970-02-15', 1)
--			,(N'Фролова', N'Александра', N'Сергеевна', N'1970-02-15', 1)
--			,(N'Бендерюк', N'Иван', N'Алексеевич', N'1970-02-15', 1)
--;

--SELECT
--		 last_name AS N'Фамилия'
--		,first_name AS N'Имя'
--		,middle_name AS N'отчество'
--		,birth_date AS N'Дата Рождения'
--		,[group]	AS N'Номер группы'
--FROM	Students
--WHERE	[group] =	1
--ORDER	BY last_name;

--===================================================================================================================================================--
--Заполнение расписания
--INSERT		Schedule
--			([date], [time], [group], discipline, teacher, [subject], [status])
--VALUES
			

