------------------------------------1. По каждому направлению обучения вывести количество групп и количество студентов----------------------------------------
--USE PV_521_Import;
--SELECT
--				direction_name					AS		N'Направление обучения'
--			,	COUNT(stud_id)					AS		N'Количество студентов'
--			,	COUNT(DISTINCT group_id)		AS		N'Количество групп'
----https://learn.microsoft.com/ru-ru/sql/t-sql/functions/count-transact-sql?view=sql-server-ver17
--FROM			Students, Groups, Directions
--WHERE			[group]					=		group_id			
--AND			direction				=		direction_id
--GROUP BY		direction_name
--;

------------------------------------2. Для каждого преподавателя вывести количество дисциплин, котороые он может вести----------------------------------------
--USE PV_521_Import;
--SELECT
--				[Преподаватель]										=		FORMATMESSAGE(N'%s %s %s', last_name, first_name, middle_name)						
--			,	COUNT(TeachersDisciplinesRelation.discipline)		AS		N'Количество дисциплин'
--FROM			Teachers, TeachersDisciplinesRelation
--WHERE			Teachers.teacher_id									=		TeachersDisciplinesRelation.teacher
--Group BY teacher_id, last_name, first_name, middle_name
--;

------------------------------3. Для каждой дисциплины вывести количество преподавателей, которые могут вести эту дисциплину----------------------------------
--USE PV_521_Import;
--SELECT
--				discipline_name								AS		N'Дисциплина'
--			,	COUNT(teacher)								AS		N'Количество преподавателей'
--FROM			Disciplines, TeachersDisciplinesRelation
--WHERE			Disciplines.discipline_id					=		discipline
--GROUP BY		discipline_name
--;






-------------------------------------4. Заполнить таблицу с расписанием для своей группы от начала обучения по сей день---------------------------------------
--=============================================================================================================================================--
--==========================================================Заполнение дисциплин===============================================================--
--=============================================================================================================================================--
USE PV_521_DDL;

--INSERT Disciplines
--		 (discipline_id, discipline_name, number_of_lessons)
--VALUES 
--		 (1, N'Основы информационных технологий', 50)
--		,(2, N'Основы программирования на языке с++', 138)
--		,(3, N'Конфигурирование Windows 10', 66)
--		,(4, N'Объектно-ориентированное программирование с использованием языка с++', 114)
--		,(5, N'Объектно-ориентированное проектирование. Язык UML и паттерны проектирования', 38)
--		,(6, N'Платформа Microsoft.NET и язык программирования с#', 70)
--		,(7, N'Основы разработки приложений с использованием Windows Forms и WPF', 66)
--		,(8, N'Теория баз данных. Программирование MS SQL Server', 44)
--;

--SELECT 
--         discipline_name        AS      N'Название дисциплины'
--        ,number_of_lessons      AS     N'Количество часов'
--FROM Disciplines;	

--DELETE FROM Disciplines WHERE discipline_id IN (1, 2, 3, 4, 5, 6, 7, 8);	


--=============================================================================================================================================--
--=====================================================Заполнение преподавателей===============================================================--
--=============================================================================================================================================--

--Insert	Teachers
--			(teacher_id, last_name, first_name, middle_name, birth_date)
--VALUES
--			(1, N'Ковтун ', N'Олег ', N'Анатольевич ', N'1970-02-15')
--		   ,(2, N'Свищев ', N'Алексей ', N'Викторович ', N'1970-02-15')
--;

--SELECT 
--		last_name AS N'Фамилия'
--       ,first_name AS N'Имя'
--       ,middle_name AS N'Отчество'
--       ,birth_date AS N'Дата рождения'
--FROM Teachers;

--DELETE FROM Teachers WHERE teacher_id IN (1, 2, 3, 4)

--=============================================================================================================================================--
--========================================================Заполнение Направлений===============================================================--
--=============================================================================================================================================--

--INSERT Directions
--		 (direction_id, direction_name)
--VALUES 
--		 (1, N'Разработка программного обеспечения')
--		,(2, N'Сетевые технологии и системное администрирование')
--		,(3, N'Компьютерная графика и дизайн')
--		,(4, N'РПО')
--		,(5, N'1С: программирование и администрирование')
--		,(6, N'back-end разработка')
--		,(7, N'DevOps-инженерия')
--		,(8, N'GameDev Junior')
--		,(9, N'Motion design')
--		,(10, N'SEO-специалист')
--		,(11, N'SMM-менеджер')
--		,(12, N'UX/UI дизайн')
--		,(13, N'графический дизайн')
--		,(14, N'дизайн интерьеров')
--		,(15, N'интернет-маркетинг')
--		,(16, N'мастер нейросетей')
--		,(17, N'менеджер маркетплейсов')
--;

--SELECT 
--		direction_id 
--       ,direction_name AS N'Направление'
--FROM Directions;

--DELETE FROM Directions WHERE direction_id IN (1, 2, 3, 4);


--=============================================================================================================================================--
--============================================================Заполнение Групп=================================================================--
--=============================================================================================================================================--

--INSERT			Groups
--				(group_id, group_name, direction)
--VALUES
--		(1, N'PV_521', 4)
--;

--SELECT 
--		  group_name AS N'Группа'
--       ,direction AS N'Направление'
--FROM Groups;

--=============================================================================================================================================--
--===========================================================Заполнение Студентов==============================================================--
--=============================================================================================================================================--

--INSERT		Students
--			(last_name, first_name, middle_name, birth_date, [group])
--VALUES
--			 (N'Полищук', N'Андрей', N'Григорьевич', N'1970-02-15', 1)
--			,(N'Жук', N'Василий', N'Анатольевич', N'1970-02-15', 1)
--			,(N'Голумбиевская', N'Екатерина', N'Александровна', N'1970-02-15', 1)
--			,(N'Юзгин', N'Николай', N'Игоревич', N'1970-02-15', 1)
--			,(N'Тарасов', N'Евгений', N'Алексеевич', N'1970-02-15', 1)
--			,(N'ZXC', N'Tulskiy', N'Ghoul', N'1970-02-15', 1)
--			,(N'Хромов', N'Сергей', N'Александрович', N'1970-02-15', 1)
--			,(N'Вербицкий', N'Илья', N'Юрьевич', N'1970-02-15', 1)
--			,(N'Султанов', N'Ростислав', N'Витальевич', N'1970-02-15', 1)
--			,(N'Пеливанов', N'Иван', N'Иванович', N'1970-02-15', 1)
--			,(N'Черепенин', N'Матвей', N'Алексеевич', N'1970-02-15', 1)
--			,(N'Литвинов', N'Ярослав', N'Александрович', N'1970-02-15', 1)
--			,(N'Кнюдде', N'Сергей', N'Евгеньевич', N'1970-02-15', 1)
--			,(N'Цыбулько', N'Богдан', N'Романович', N'1970-02-15', 1)
--			,(N'Вилль', N'Никита', N'Андреевич', N'1970-02-15', 1)
--			,(N'Колесников', N'Эдуард', N'Геннадиевич', N'1970-02-15', 1)
--			,(N'Репин', N'Рамиль', N'Сеймурович', N'1970-02-15', 1)
--			,(N'Серова', N'Дарья', N'Романовна', N'1970-02-15', 1)
--			,(N'Аркатов', N'Тимур', N'Александрович', N'1970-02-15', 1)
--			,(N'Калинин', N'Виталий', N'Алексеевич', N'1970-02-15', 1)
--			,(N'Соколов', N'Александр', N'Валерьевич', N'1970-02-15', 1)
--			,(N'Перин', N'Илья', N'Вадимович', N'1970-02-15', 1)
--			,(N'Иванов', N'Максим', N'Олегович', N'1970-02-15', 1)
--			,(N'Юшков', N'Лаврентий', N'Тихонович', N'1970-02-15', 1)
--			,(N'Морозов', N'Дмитрий', N'Евгеньевич', N'1970-02-15', 1)
--			,(N'Фролова', N'Александра', N'Сергеевна', N'1970-02-15', 1)
--			,(N'Бендерюк', N'Иван', N'Алексеевич', N'1970-02-15', 1)
--;

--SELECT
--		 last_name AS N'Фамилия'
--		,first_name AS N'Имя'
--		,middle_name AS N'отчество'
--		,birth_date AS N'Дата Рождения'
--		,[group]	AS N'Номер группы'
--FROM	Students
--WHERE	[group] =	1
--ORDER	BY last_name;

--=============================================================================================================================================--
--==========================================================Заполнение расписания==============================================================--

--DECLARE @START_OOP DATE = '2025-06-23';	--DECLARE - нужна для инициализации переменной
----(задал здесь две переменных, которые обозначают начало и конец временного отрезка, во время которого проходили Объектно-ориентированное программирование)
--DECLARE @END_OOP DATE = '2025-09-15';
----https://learn.microsoft.com/ru-ru/sql/t-sql/language-elements/variables-transact-sql?view=sql-server-ver17


--DECLARE @LessonID	INT;	--Инициализировал переменную для хранения свободного айдишника в бд
--SELECT	@LessonID = ISNULL(MAX(lesson_id), 0)+ 1 FROM Schedule; --MAX(lesson_id) - находит максимально существующий айди в таблице, а ISNULL 
----проверяет таблицу на пустоту, и если она пуста, то начинает с нуля

----ISNULL https://learn.microsoft.com/ru-ru/sql/t-sql/functions/isnull-transact-sql?view=sql-server-ver17
----MAX	 https://learn.microsoft.com/ru-ru/sql/t-sql/functions/max-transact-sql?view=sql-server-ver17

--WITH СЕМЕСТР_ООП AS	--Создаю временную таблицу с датами, назвал так себе, но пойдёт...
--(
--	SELECT @START_OOP AS LessonDate	--Выбираю первую дату
--	UNION ALL						--UNION ALL - объединяет результаты всех селект запросов в один
--	--	https://learn.microsoft.com/ru-ru/sql/t-sql/language-elements/set-operators-union-transact-sql?view=sql-server-ver17
--	SELECT	DATEADD(day, 1, LessonDate)	--Присоединяю к предыдущей дате следующую
--	--DATEADD https://learn.microsoft.com/ru-ru/sql/t-sql/functions/dateadd-transact-sql?view=sql-server-ver17
--	FROM СЕМЕСТР_ООП
--	WHERE LessonDate < @END_OOP	--И так до тех пор, пока не пройдём весь цикл доо последней даты
--),
--ScheduleDays AS	--Произвожу фильтрацию по дням недели
--(
--	--Беру все даты из временной таблицы
--	SELECT
--			LessonDate,	--сама дата
--			DATEPART(WEEKDAY, LessonDate) AS WEEKDAY,	--номер дня недели	
--			--DATEPART	https://learn.microsoft.com/en-us/sql/t-sql/functions/datepart-transact-sql?view=sql-server-ver17
--			ROW_NUMBER() OVER (ORDER BY LessonDate)	AS	LessonNumber	--Высчитываю порядковый номер
--			--ROW NUMBER https://learn.microsoft.com/ru-ru/sql/t-sql/functions/row-number-transact-sql?view=sql-server-ver17
--	FROM	СЕМЕСТР_ООП
--	WHERE	DATEPART(WEEKDAY, LessonDate) IN (2,4,6)	-- Делаю фильтр, оставляя только понедельник, среду и пятницу
--	--(В SQl неделя начинается с воскресенья, поэтому делаю выборку по двойке, четвёрке и шестёрке)
--)

--INSERT INTO Schedule (lesson_id, [date], [time], [group], discipline, teacher, [subject], [status])		--Ну и вставляю данные
--SELECT
--		 @LessonID + ROW_NUMBER() OVER (ORDER BY LessonDate) - 1 AS lesson_id	--высчитываю айди для урока, в который можно было бы вставить занятие
--		,LessonDate	AS	[date]	--всё остальное по стандарту
--		,N'18:30:00'AS	[time]
--		,1			AS  [group]
--		,4			AS  discipline
--		,1			AS	teacher
--		,N'Объектно-ориентированное программирование с использованием языка с++'	AS	[subject]
--		,1			AS	[status]
--FROM		ScheduleDays
--ORDER BY	LessonDate
--OPTION		(MAXRECURSION 0);	--Эта строка нужна для безграничного выполнения рекурсии, мне она скорее всего не пригодится, но... кто знает, кто знает...
--По умолчанию рекурсия в транзакт SQL не может превышать сто повторений

--Сводка с сайта майкрософта:

--MAXRECURSION <integer_value>
--Указывает максимальное количество рекурсий, разрешенных для этого запроса. число является положительным целым числом от 0 до 32 767. Если задано значение 0, ограничение не применяется. Если этот параметр не указан, ограничение по умолчанию для сервера равно 100.

--Когда указанное или стандартное число для MAXRECURSION ограничения достигается во время выполнения запроса, запрос заканчивается и возвращается ошибка.

--Из-за этой ошибки все эффекты инструкции откатываются. Если оператор является оператором, частичные SELECT результаты или не могут быть возвращены. Любые частичные результаты, возвращаемые, могут не включать все строки на уровнях рекурсии за пределы указанного максимального уровня рекурсии.

--Дополнительные сведения см. в разделе WITH common_table_expression.

-- https://learn.microsoft.com/ru-ru/sql/t-sql/queries/hints-transact-sql-query?view=sql-server-ver17

--OPTION https://learn.microsoft.com/ru-ru/sql/t-sql/queries/option-clause-transact-sql?view=sql-server-ver17
------------------------------------------------------------------------------------------------------------------------------------------------
--SELECT 
--		 [date]		AS	N'Дата'
--		,[time]		AS	N'Время занятий'
--		,[subject]	AS	N'Тема'
--		,[status]	AS	N'Статус'
--FROM Schedule ORDER BY [date]
--;

------------------------------------------------------------------------------------------------------------------------------------------------
--DELETE FROM Schedule 
--WHERE [date] BETWEEN '2025-06-23' AND '2025-10-15'
--;
-------------------------------------------------------------------------------------------------------------------------------------------------

--DECLARE @START_OO_PROEKTIROVANIE DATE = '2025-09-17';
--DECLARE @END_OO_PROEKTIROVANIE DATE = '2025-10-06';

--DECLARE @LessonID	INT;
--SELECT	@LessonID = ISNULL(MAX(lesson_id), 0)+ 1 FROM Schedule;

--WITH OO_PROEKTIROVANIE AS
--(
--	SELECT @START_OO_PROEKTIROVANIE AS LessonDate
--	UNION ALL
--	SELECT	DATEADD(day, 1, LessonDate)
--	FROM OO_PROEKTIROVANIE
--	WHERE LessonDate < @END_OO_PROEKTIROVANIE
--),
--ScheduleDays AS
--(
--	SELECT
--			LessonDate,
--			DATEPART(WEEKDAY, LessonDate) AS WEEKDAY,
--			ROW_NUMBER() OVER (ORDER BY LessonDate)	AS	LessonNumber
--	FROM	OO_PROEKTIROVANIE
--	WHERE	DATEPART(WEEKDAY, LessonDate) IN (2,4,6)
--)

--INSERT INTO Schedule (lesson_id, [date], [time], [group], discipline, teacher, [subject], [status])
--SELECT
--		 @LessonID + ROW_NUMBER() OVER (ORDER BY LessonDate) - 1 AS lesson_id
--		,LessonDate	AS	[date]
--		,N'18:30:00'AS	[time]
--		,1			AS  [group]
--		,5			AS  discipline
--		,1			AS	teacher
--		,N'Объектно-ориентированное проектирование. Язык UML и паттерны проектирования'	AS	[subject]
--		,1			AS	[status]
--FROM		ScheduleDays
--ORDER BY	LessonDate
--OPTION		(MAXRECURSION 0);

------------------------------------------------------------------------------------------------------------------------------------------------
--SELECT 
--		 [date]		AS	N'Дата'
--		,[time]		AS	N'Время занятий'
--		,[subject]	AS	N'Тема'
--		,[status]	AS	N'Статус'
--FROM Schedule ORDER BY [date]
--;
-------------------------------------------------------------------------------------------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------------------------------
--DELETE FROM Schedule 
--WHERE [date] BETWEEN '2025-09-17' AND '2025-10-06'
--;
-------------------------------------------------------------------------------------------------------------------------------------------------
				
--DECLARE @START_CSHARP DATE = '2025-10-08';
--DECLARE @END_CSHARP DATE = '2025-11-14';

--DECLARE @LessonID	INT;
--SELECT	@LessonID = ISNULL(MAX(lesson_id), 0)+ 1 FROM Schedule;

--WITH CSHARP AS
--(
--	SELECT @START_CSHARP AS LessonDate
--	UNION ALL
--	SELECT	DATEADD(day, 1, LessonDate)
--	FROM CSHARP
--	WHERE LessonDate < @END_CSHARP
--),
--ScheduleDays AS
--(
--	SELECT
--			LessonDate,
--			DATEPART(WEEKDAY, LessonDate) AS WEEKDAY,
--			ROW_NUMBER() OVER (ORDER BY LessonDate)	AS	LessonNumber
--	FROM	CSHARP
--	WHERE	DATEPART(WEEKDAY, LessonDate) IN (2,4,6)
--)

--INSERT INTO Schedule (lesson_id, [date], [time], [group], discipline, teacher, [subject], [status])
--SELECT
--		 @LessonID + ROW_NUMBER() OVER (ORDER BY LessonDate) - 1 AS lesson_id
--		,LessonDate	AS	[date]
--		,N'18:30:00'AS	[time]
--		,1			AS  [group]
--		,6			AS  discipline
--		,1			AS	teacher
--		,N'Платформа Microsoft.NET и язык программирования с#'	AS	[subject]
--		,1			AS	[status]
--FROM		ScheduleDays
--ORDER BY	LessonDate
--OPTION		(MAXRECURSION 0);

-------------------------------------------------------------------------------------------------------------------------------------------------

--DECLARE @START_WPF DATE = '2025-11-17';
--DECLARE @END_WPF DATE = '2025-12-22';

--DECLARE @LessonID	INT;
--SELECT	@LessonID = ISNULL(MAX(lesson_id), 0)+ 1 FROM Schedule;

--WITH WPF AS
--(
--	SELECT @START_WPF AS LessonDate
--	UNION ALL
--	SELECT	DATEADD(day, 1, LessonDate)
--	FROM WPF
--	WHERE LessonDate < @END_WPF
--),
--ScheduleDays AS
--(
--	SELECT
--			LessonDate,
--			DATEPART(WEEKDAY, LessonDate) AS WEEKDAY,
--			ROW_NUMBER() OVER (ORDER BY LessonDate)	AS	LessonNumber
--	FROM	WPF
--	WHERE	DATEPART(WEEKDAY, LessonDate) IN (2,4,6)
--)

--INSERT INTO Schedule (lesson_id, [date], [time], [group], discipline, teacher, [subject], [status])
--SELECT
--		 @LessonID + ROW_NUMBER() OVER (ORDER BY LessonDate) - 1 AS lesson_id
--		,LessonDate	AS	[date]
--		,N'18:30:00'AS	[time]
--		,1			AS  [group]
--		,7			AS  discipline
--		,1			AS	teacher
--		,N'Основы разработки приложений с использованием Windows Forms и WPF'	AS	[subject]
--		,1			AS	[status]
--FROM		ScheduleDays
--ORDER BY	LessonDate
--OPTION		(MAXRECURSION 0);

-------------------------------------------------------------------------------------------------------------------------------------------------

--DECLARE @START_DB DATE = '2025-12-24';
--DECLARE @END_DB DATE = '2026-01-28';

--DECLARE @LessonID	INT;
--SELECT	@LessonID = ISNULL(MAX(lesson_id), 0)+ 1 FROM Schedule;

--WITH [DATABASE] AS
--(
--	SELECT @START_DB AS LessonDate
--	UNION ALL
--	SELECT	DATEADD(day, 1, LessonDate)
--	FROM [DATABASE]
--	WHERE LessonDate < @END_DB
--),
--ScheduleDays AS
--(
--	SELECT
--			LessonDate,
--			DATEPART(WEEKDAY, LessonDate) AS WEEKDAY,
--			ROW_NUMBER() OVER (ORDER BY LessonDate)	AS	LessonNumber
--	FROM	[DATABASE]
--	WHERE	DATEPART(WEEKDAY, LessonDate) IN (2,4,6)
--)

--INSERT INTO Schedule (lesson_id, [date], [time], [group], discipline, teacher, [subject], [status])
--SELECT
--		 @LessonID + ROW_NUMBER() OVER (ORDER BY LessonDate) - 1 AS lesson_id
--		,LessonDate	AS	[date]
--		,N'18:30:00'AS	[time]
--		,1			AS  [group]
--		,8			AS  discipline
--		,1			AS	teacher
--		,N'Теория баз данных. Программирование MS SQL Server'	AS	[subject]
--		,1			AS	[status]
--FROM		ScheduleDays
--ORDER BY	LessonDate
--OPTION		(MAXRECURSION 0);

-------------------------------------------------------------------------------------------------------------------------------------------------

--SELECT 
--		 [date]		AS	N'Дата'
--		,[time]		AS	N'Время занятий'
--		,[subject]	AS	N'Тема'
--		,[status]	AS	N'Статус'
--FROM Schedule ORDER BY [date]
;

-------------------------------------------------------------------------------------------------------------------------------------------------



--INSERT Schedule 
--				(lesson_id, [date], [time], [group], discipline, teacher, [subject], [status])
--VALUES	
--		(96, N'2025-01-20', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(97, N'2025-01-22', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(98, N'2025-01-24', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(99, N'2025-01-27', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(100, N'2025-01-29', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(101, N'2025-02-03', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(102, N'2025-02-05', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(103, N'2025-02-07', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(104, N'2025-02-14', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(105, N'2025-02-19', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(106, N'2025-02-21', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(107, N'2025-03-19', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(108, N'2025-03-21', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(109, N'2025-03-28', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(110, N'2025-04-02', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(111, N'2025-04-04', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(112, N'2025-04-11', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(113, N'2025-04-16', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(114, N'2025-04-18', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(115, N'2025-04-25', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(116, N'2025-04-30', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(117, N'2025-05-16', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(118, N'2025-05-21', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(119, N'2025-05-23', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(120, N'2025-05-30', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(121, N'2025-06-04', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(122, N'2025-06-06', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(123, N'2025-06-09', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(124, N'2025-06-11', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(125, N'2025-06-13', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(126, N'2025-06-16', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(127, N'2025-06-18', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--	   ,(128, N'2025-06-20', N'18:30:00', 1, 2, 1, N'Основы программирования на языке С++', 1)
--;

--DELETE FROM Schedule 
--WHERE [date] BETWEEN '2025-01-20' AND '2025-06-20'

------------------------|
--DELETE FROM Schedule; |
-------------------------------------------------------------------------------------------------------------------------------------

--INSERT Schedule 
--				(lesson_id, [date], [time], [group], discipline, teacher, [subject], [status])
--VALUES	
--		(129, N'2025-02-10', N'18:30:00', 1, 1, 2, N'Основы информационных технологий', 1)
--	   ,(130, N'2025-02-12', N'18:30:00', 1, 1, 2, N'Основы информационных технологий', 1)
--	   ,(131, N'2025-02-17', N'18:30:00', 1, 1, 2, N'Основы информационных технологий', 1)
--	   ,(132, N'2025-02-24', N'18:30:00', 1, 1, 2, N'Основы информационных технологий', 1)
--	   ,(133, N'2025-02-26', N'18:30:00', 1, 1, 2, N'Основы информационных технологий', 1)
--	   ,(134, N'2025-02-28', N'18:30:00', 1, 1, 2, N'Основы информационных технологий', 1)
--	   ,(135, N'2025-03-03', N'18:30:00', 1, 1, 2, N'Основы информационных технологий', 1)
--	   ,(136, N'2025-03-05', N'18:30:00', 1, 1, 2, N'Основы информационных технологий', 1)
--	   ,(137, N'2025-03-07', N'18:30:00', 1, 1, 2, N'Основы информационных технологий', 1)
--	   ,(138, N'2025-03-10', N'18:30:00', 1, 1, 2, N'Основы информационных технологий', 1)
--	   ,(139, N'2025-03-12', N'18:30:00', 1, 1, 2, N'Основы информационных технологий', 1)
--	   ,(140, N'2025-03-14', N'18:30:00', 1, 1, 2, N'Основы информационных технологий', 1)
--;

SELECT 
		 [date]		AS	N'Дата'
		,[time]		AS	N'Время занятий'
		,[subject]	AS	N'Тема'
		,[status]	AS	N'Статус'
FROM Schedule ORDER BY [date]
;